Autodesk.Revit.DB.Structure.RebarConstraint.HasAnEdgeNumber
Checks if the getTargetRebarEdgeNumber method can be called for the RebarConstraint.
Remarks:
The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar,' and the
RebarTargetConstraintType must be 'Edge' or 'BarBend.'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.TargetIsHookBend
Returns true if the RebarTargetConstraintType of the RebarConstraint is 'HookBend'.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.TargetIsBarBend
Returns true if the RebarTargetConstraintType of the RebarConstraint is 'BarBend'.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.TargetRebarConstraintTypeIsEdge
Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar,'
and the RebarConstraint is attached to an edge of the other Rebar Element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.IsToHostFaceOrCover
Returns true if the RebarConstraintType of the RebarConstraint is either 'FixedDistanceToHostFace' or 'ToCover.'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.IsToOtherRebar
Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar.'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.IsToCover
Returns true if the RebarConstraintType of the RebarConstraint is 'ToCover.'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.IsFixedDistanceToHostFace
Returns true if the RebarConstraintType of the RebarConstraint is 'FixedDistanceToHostFace.'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.IsValid
Checks that the RebarConstraint still has access to valid Rebar constraint data
and that its RebarConstraintsManager is still valid.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.IsReferenceValidForConstraint(Autodesk.Revit.DB.Reference)
Checks if the reference provided can be used in creating Rebar constraints
Remarks:
Reference is valid if it points to an uncut face of a structural that can host rebar.
targetReference:
The reference to be checked
Returns:
returns true if reference can be used in a constraint, false otherwise
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019.1

Autodesk.Revit.DB.Structure.RebarConstraint.ReplaceReferenceTargets(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Boolean,System.Double)
Replaces the current set of references, the type of constraint and the offset value, with the newly provided ones.
Will throw exception if this is a constraint for Shape Driven Rebar.
handle:
The RebarConstrainedHandle that has this constraint.
targetReferences:
The references to which the rebar handle will be constrained.
This collection must contain one or more references to faces of elements that can host rebar.
isConstraintToCover:
If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue:
The distance from references to the rebar handle.
Throws Autodesk.Revit.Exceptions.ArgumentException:
handle is no longer valid.
-or-
targetReferences is empty.
-or-
targetReferences do not represent faces from structurals that can host rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Constrained rebar is a shape driven rebar element.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.GetCustomHandleTag
Returns the handle tag of the RebarConstrainedHandle.
This is valid only for Free Form Rebar.
Returns:
Returns the handle tag of the RebarConstrainedHandle.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Constrained rebar is a shape driven rebar element.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.Create(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Boolean,System.Double)
This method creates a constraint for a given Rebar Constrained Handle Tag.
Will throw exception if used for Shape Driven Rebar.
handle:
The handle of the rebar that will be constrained.
targetReferences:
The references to which the rebar handle will be constrained.
This collection must contain one or more references to faces of elements that can host rebar.
isConstraintToCover:
If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue:
The distance from references to the rebar handle.
Returns:
Returns the newly created RebarConstraint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Constrained rebar is a shape driven rebar element.
-or-
handle is no longer valid.
-or-
targetReferences is empty.
-or-
targetReferences do not represent faces from structurals that can host rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.IsEqual(Autodesk.Revit.DB.Structure.RebarConstraint)
Returns true if the specified RebarConstraint is the same as 'this.'  The method
can be used to determine which of the RebarConstraint candidates offered by the
RebarConstraintsManager is currently active.
Throws Autodesk.Revit.Exceptions.ArgumentException:
other is no longer valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarAngleOnBarOrHookBend
Returns the angular increment along a bar or hook bend to which the RebarConstraint is attached.
Remarks:
Only applies to RebarConstraints with TargetRebarConstraintType BarBend or HookBend.
For HookBends, values can be 0, 1, 2, 3 or 4, representing angular locations of 0, 45, 90, 135,
and 180 degrees around the hook, starting at the 'base' of the hook (or end of the bar without hook).
For interior BarBends, values can 0 or 1, where 0 means at the intersection of the bar bend and the edge
specified by getTargetRebarEdgeNumber, and 1 means the mid-point of the bend arc.
Rebar must be Shape Driven Rebar element.
Returns:
The angular increment relative to the reference bar edge.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarTargetConstraintType is not 'HookBend' or 'BarBend'.
-or-
Constrained rebar is a free form rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarHookBarEnd
Returns 0 or 1 to indicate which end hook on the other Rebar Element to which this RebarConstraint is attached.
The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType
must be 'HookBend.'
Rebar must be Shape Driven Rebar element.
Remarks:
0 means start of the bar, and 1 indicates end of the bar.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarTargetConstraintType is not 'HookBend'
-or-
Constrained rebar is a free form rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarBendNumber
Returns the number of the bend on the other Rebar Element to which this RebarConstraint is attached.
The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType
must be 'BarBend.'
Rebar must be Shape Driven Rebar element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarTargetConstraintType is not 'BarBend'
-or-
Constrained rebar is a free form rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarEdgeNumber
Returns the number of the edge on the other Rebar Element to which this RebarConstraint is attached.
The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType
must be 'Edge.'
Rebar must be Shape Driven Rebar element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
The RebarConstraint is not attached to an edge, or bend, or hook bend of another Rebar Element.
-or-
Constrained rebar is a free form rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarConstraintType
Returns the TargetRebarConstraintType of the handle on the other Rebar Element
to which this RebarConstraint is attached. The RebarConstraintType of the
RebarConstraint must be 'ToOtherRebar.'
Rebar must be Shape Driven Rebar element.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.'
-or-
Constrained rebar is a free form rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.SetDistanceToTargetCover(System.Double)
Sets the distance from the RebarConstrainedHandle to the target Host Cover Element surface.
The RebarConstraintType of the RebarConstraint must be 'ToCover.'
distanceToTargetCover:
The distance is given as an offset value, the sign of which depends on Host Cover direction.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for distanceToTargetCover must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToCover.'
Since:
2016

Autodesk.Revit.DB.Structure.RebarConstraint.GetDistanceToTargetCover
Returns the distance from the RebarConstrainedHandle to the target Host Cover Element surface.
The RebarConstraintType of the RebarConstraint must be 'ToCover.'
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToCover.'
Since:
2016

Autodesk.Revit.DB.Structure.RebarConstraint.SetDistanceToTargetHostFace(System.Double)
Sets the distance from the RebarConstrainedHandle to the target Host Element surface.
The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace.'
offset:
The distance is given as an offset value, the sign of which depends on Host Face direction.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for offset must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace.'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetDistanceToTargetHostFace
Returns the distance from the RebarConstrainedHandle to the target Host Element surface.
The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace.'
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace.'
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetHostFaceReference
Returns a reference to the host Element face to which the RebarConstraint is attached.
The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.'
Will throw exception if it's a multi target constraint.
Returns:
Requested reference.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover.'
-or-
Multi target constraint. Consider using the indexed version of the method.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetHostFaceReference(System.Int32)
Returns a reference that corresponds to the face to which the RebarConstraint is attached specified by the targetIndex.
The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.'
targetIndex:
The index of the target. Should be between 0 and NumberOfTargets().
Returns:
Requested reference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetIndex is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover.'
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetCoverType(System.Int32)
Returns the RebarCoverType for the face specified by targetIndex. Returns null if no RebarHostData is present for target element.
targetIndex:
The index of the target. Should be between 0 and NumberOfTargets().
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetIndex is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover.'
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetHostFaceAndTransform(System.Int32,Autodesk.Revit.DB.Transform)
Returns the face to which the RebarConstraint is attached associated to the given target index.
The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.'
targetIndex:
The index of the target. Should be between 0 and NumberOfTargets().
faceTransform:
Returns the transform that is associated to the face's element geometry.
Returns:
Requested Face.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetIndex is out of range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover.'
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.GetRebarConstraintTargetHostFaceType
Returns the RebarConstraintTargetHostFaceType of the host Element face to which
the RebarConstraint is attached.  The RebarConstraintType of the RebarConstraint
must be 'FixedDistanceToHostFace' or 'ToCover.'
Will throw exception if it's a multi target constraint.
Returns:
Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover.'
-or-
Multi target constraint. Consider using the indexed version of the method.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetRebarConstraintTargetHostFaceType(System.Int32)
Returns the RebarConstraintTargetHostFaceType of the host Element face to which
the RebarConstraint is attached.  The RebarConstraintType of the RebarConstraint
must be 'FixedDistanceToHostFace' or 'ToCover.'
targetIndex:
The index of the target. Should be between 0 and NumberOfTargets().
Returns:
Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetIndex is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover.'
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.AreGeometryTargetsTheSame(Autodesk.Revit.DB.Structure.RebarConstraint)
Returns true if the gemetrical targets (ex. face references, other rebar segment references) of "this" constriant are the same as the targets of the "other" constraint.
Returns false otherwise.
Only the reference to the target piece of geometry is taken into account(ex. only face references, only other rebar segment references).
Target Element (elementId) is not taken into account.
Distance to target is not taken into account.
otherConstraint:
Returns the Element object (either Host or Rebar) which provides the constraint.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetElement
Gets the Element object (either Host or Rebar) which provides the constraint.
Will throw exception if it's a multi target constraint.
Returns:
Returns the Element object (either Host or Rebar) which provides the constraint.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
Multi target constraint. Consider using the indexed version of the method.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetElement(System.Int32)
Gets the Element object (either Host or Rebar) which provides the constraint. Will return the Element which contains the face at targetIndex.
targetIndex:
The index of the target. Should be between 0 and NumberOfTargets().
Returns:
Returns the Element object (either Host or Rebar) which provides the constraint. Will return the Element which contains the face at targetIndex.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetIndex is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.GetConstraintType
Returns the RebarConstraintType of a RebarConstraint.
Returns:
The RebarConstraintType of the specified RebarConstraint.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.NumberOfTargets
Identifies the number of references associated to the rebar handle.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint
A class representing a constraint on a handle of a rebar element.
Remarks:
For Shape Driven Rebar Constraints:
Each handle on a rebar is defined by a plane, and can be constrained along the
direction perpendicular to the plane.  Rebar constraints work by locking the
handle planes to planar references, or 'targets.'  These targets can be:
planar surfaces of host elements, or the handle planes of stirrup bars (only applies to standard style bars).
For planar host element surfaces, a rebar handle can either be locked at a constant
distance, or, if the host surface has a specified cover, then the handle can be
joined directly to the cover of the surface.
Standard style bars can be locked to the handle planes of stirrup style rebar.
In the special case of a straight, standard style bar, running perpendicular
to the plane of the stirrup bar, the bar can constrain itself to distinct locations
along bends in stirrup bars - points located at 0 degrees, 45 degrees, 90 degrees,
etc. around each bend.  This is done by simultaneously locking both the straight
bar's edge handle and its planar position handle to one or both of the stirrup edges
adjacent to the bend in the stirrup.
Usually, to form a constraint, the handle plane and the reference plane must be parallel.
However, bar end handles can be constrained to planes at angles up to 60 degrees.
Arc-shaped rebar is a special case, and can form constraints to concentric host surfaces.
RebarConstraints can only be constructed internally by Revit.  They are
available to the API by querying a rebar element's RebarConstraintsManager.
For Free Form Rebar Constraints:
Each handle of the Rebar can be constrained to multiple host faces or to the face cover.
In order to create a Free Form Rebar Constraint you will need:
RebarConstraintsManager which will manage the constraint.  The rebar handle you want to constraint.  A list of target references which must be element faces to which this handle is constrained.  A Boolean value specifying that the constraint is to cover or directly to face. It will be the same value for all target references A double value that represent the  offset distance from the rebar handle to target references.
RebarConstraints for Free Form Rebar should be created using the Create method and then added to
the RebarConstraintsManager using the method SetPreferredConstraintForHandle.
Since:
2014